In [2]:
import pandas as pd
import numpy as np
import matplotlib as plt
import plotly.graph_objs as go
import os

In [3]:
os.listdir()

['Employee_Information.csv',
 'Student_Counceling_Information.csv',
 'Untitled.ipynb',
 '.ipynb_checkpoints',
 'Department_Information.csv',
 'Student_Performance_Data.csv']

In [14]:
emp_df = pd.read_csv('Employee_Information.csv')
perf_df = pd.read_csv('Student_Performance_Data.csv')
dpt_df = pd.read_csv('Department_Information.csv')
student_df = pd.read_csv('Student_Counceling_Information.csv')

In [64]:
student_df.describe(include='all')

,Student_ID,DOA,DOB,Department_Choices,Department_Admission
count,3819,3819,3819,3819,3819
unique,3819,6,1798,40,40
top,SID20137844,2015-07-01T00:00:00Z,2000-08-19T00:00:00Z,IDEPT3115,IDEPT3115
freq,1,660,8,113,113

In [40]:
student_df.drop_duplicates(subset='Student_ID',inplace=True)

In [41]:
student_df.duplicated(subset='Student_ID').sum()

0

In [30]:
perf_df.describe()

               Marks
count  209611.000000
mean       69.589573
std        18.098626
min        19.000000
25%        54.000000
50%        70.000000
75%        85.000000
max       100.000000

In [32]:
emp_df.describe()

       Employee ID                   DOB                   DOJ Department_ID
count         1000                  1000                  1000          1000
unique         998                   936                   919            34
top       IU444477  1992-10-02T00:00:00Z  2001-09-18T00:00:00Z     IDEPT5109
freq             2                     3                     3            42

In [44]:
emp_df.isna().any()

Employee ID      False
DOB              False
DOJ              False
Department_ID    False
dtype: bool

In [47]:
emp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Employee ID    1000 non-null   object
 1   DOB            1000 non-null   object
 2   DOJ            1000 non-null   object
 3   Department_ID  1000 non-null   object
dtypes: object(4)
memory usage: 31.4+ KB

In [82]:
def Born(x):
    return x.split('-')[0]
def Joined(x):
    return x.split('-')[0]

In [83]:
emp_df['Born'] = emp_df['DOB'].apply(Born)
emp_df['Joined'] = emp_df['DOJ'].apply(Joined)

In [88]:
emp_df = emp_df.drop(['DOB','DOJ'],axis=1)

In [89]:
emp_df.head()

  Employee ID Department_ID  Born Joined
0    IU196557     IDEPT4938  1983   2009
1    IU449901     IDEPT2357  1985   2009
2    IU206427     IDEPT4670  1971   2008
3    IU688905     IDEPT2601  1973   2002
4    IU634582     IDEPT7626  1991   2000

In [49]:
emp_df.duplicated(subset='Employee ID').any()

True

In [50]:
emp_df.drop_duplicates(subset='Employee ID',inplace=True)

In [51]:
emp_df.duplicated(subset='Employee ID').any()

False

In [90]:
emp_df.head()

  Employee ID Department_ID  Born Joined
0    IU196557     IDEPT4938  1983   2009
1    IU449901     IDEPT2357  1985   2009
2    IU206427     IDEPT4670  1971   2008
3    IU688905     IDEPT2601  1973   2002
4    IU634582     IDEPT7626  1991   2000

In [105]:
perf_df.head()

    Student_ID Semster_Name     Paper_ID Paper_Name  Marks
0  SID20131143        Sem_1  SEMI0012995    Paper 1     44
1  SID20131143        Sem_1  SEMI0015183    Paper 2     74
2  SID20131143        Sem_1  SEMI0018371    Paper 3     80
3  SID20131143        Sem_1  SEMI0015910    Paper 4     44
4  SID20131143        Sem_1  SEMI0016208    Paper 5     95

In [92]:
student_df.head()

,Student_ID,DOA,DOB,Department_Choices,Department_Admission
0,SID20131143,2013-07-01T00:00:00Z,1996-02-05T00:00:00Z,IDEPT7783,IDEPT7783
1,SID20131151,2013-07-01T00:00:00Z,1995-07-31T00:00:00Z,IDEPT6347,IDEPT6347
2,SID20131171,2013-07-01T00:00:00Z,1995-09-05T00:00:00Z,IDEPT1836,IDEPT1836
3,SID20131176,2013-07-01T00:00:00Z,1996-01-12T00:00:00Z,IDEPT8473,IDEPT8473
4,SID20131177,2013-07-01T00:00:00Z,1995-07-30T00:00:00Z,IDEPT5528,IDEPT5528

In [93]:
def Admitted(x):
    return x.split('-')[0]
def Born(x):
    return x.split('-')[0]

In [96]:
student_df['Admitted'] = student_df['DOA'].apply(Admitted)
student_df['Born'] = student_df['DOB'].apply(Born)

In [132]:
student_df = student_df.drop(['Born'],axis=1)

In [133]:
student_df

       Student_ID Department_Choices Department_Admission Admitted
0     SID20131143          IDEPT7783            IDEPT7783     2013
1     SID20131151          IDEPT6347            IDEPT6347     2013
2     SID20131171          IDEPT1836            IDEPT1836     2013
3     SID20131176          IDEPT8473            IDEPT8473     2013
4     SID20131177          IDEPT5528            IDEPT5528     2013
...           ...                ...                  ...      ...
3995  SID20189921          IDEPT7005            IDEPT7005     2018
3996  SID20189926          IDEPT1836            IDEPT1836     2018
3997  SID20189949          IDEPT4938            IDEPT4938     2018
3998  SID20189982          IDEPT6347            IDEPT6347     2018
3999  SID20189989          IDEPT3062            IDEPT3062     2018

[3819 rows x 4 columns]

In [107]:
perf_df

         Student_ID Semster_Name     Paper_ID Paper_Name  Marks
0       SID20131143        Sem_1  SEMI0012995    Paper 1     44
1       SID20131143        Sem_1  SEMI0015183    Paper 2     74
2       SID20131143        Sem_1  SEMI0018371    Paper 3     80
3       SID20131143        Sem_1  SEMI0015910    Paper 4     44
4       SID20131143        Sem_1  SEMI0016208    Paper 5     95
...             ...          ...          ...        ...    ...
209606  SID20189989        Sem_8  SEMI0082598    Paper 3     94
209607  SID20189989        Sem_8  SEMI0088030    Paper 4     49
209608  SID20189989        Sem_8  SEMI0081794    Paper 5     47
209609  SID20189989        Sem_8  SEMI0086600    Paper 6     87
209610  SID20189989        Sem_8  SEMI0083259    Paper 7     73

[209611 rows x 5 columns]

In [121]:
perf_df.dtypes

Student_ID      object
Semster_Name    object
Paper_ID        object
Paper_Name      object
Marks            int64
dtype: object

In [134]:
student_perf = pd.merge(perf_df,student_df,on='Student_ID')

In [135]:
student_perf.head()

,Student_ID,Semster_Name,Paper_ID,Paper_Name,Marks,Department_Choices,Department_Admission,Admitted
0,SID20131143,Sem_1,SEMI0012995,Paper 1,44,IDEPT7783,IDEPT7783,2013
1,SID20131143,Sem_1,SEMI0015183,Paper 2,74,IDEPT7783,IDEPT7783,2013
2,SID20131143,Sem_1,SEMI0018371,Paper 3,80,IDEPT7783,IDEPT7783,2013
3,SID20131143,Sem_1,SEMI0015910,Paper 4,44,IDEPT7783,IDEPT7783,2013
4,SID20131143,Sem_1,SEMI0016208,Paper 5,95,IDEPT7783,IDEPT7783,2013

In [156]:
student_perf.dtypes

Student_ID              object
Semster_Name            object
Paper_ID                object
Paper_Name              object
Marks                    int64
Department_Choices      object
Department_Admission    object
Admitted                object
dtype: object

In [157]:
years = range(2013,2019)

In [165]:
student_perf['Admitted']=student_perf['Admitted'].astype(int)

In [243]:
yr2013 = student_perf[student_perf['Admitted']==2013]
yr2013 = yr2013.rename(columns={'Department_Admission':"Department_ID"})

In [244]:
yr2013.dtypes

Student_ID            object
Semster_Name          object
Paper_ID              object
Paper_Name            object
Marks                  int64
Department_Choices    object
Department_ID         object
Admitted               int64
dtype: object

In [247]:
yr2013 = pd.merge(yr2013,dpt_df,on='Department_ID')

In [248]:
top10dept=pd.DataFrame
top10dept= yr2013.groupby('Department_Name')['Marks'].mean().nlargest(10)
top10dept

Department_Name
Physics                                                          71.115778
Industrial Engineering and Operations Research (IEOR)            71.062366
National Centre for Aerospace Innovation and Research (NCAIR)    70.765507
Mathematics                                                      70.483516
Centre for Technology Alternatives for Rural Areas (CTARA)       70.357798
Sophisticated Analytical Instrument Facility (SAIF)              70.335036
Metallurgical Engineering & Materials Science                    70.297018
Biosciences and Bioengineering                                   70.199653
School of Management                                             70.176966
Centre for Distance Engineering Education Programme (CDEEP)      70.142308
Name: Marks, dtype: float64

In [229]:
top10dept['Department_ID'] = top10dept.index.values

In [230]:
top10dept

Department_Admission
IDEPT2425                                                  71.1158
IDEPT8825                                                  71.0624
IDEPT7626                                                  70.7655
IDEPT8379                                                  70.4835
IDEPT1533                                                  70.3578
IDEPT6347                                                   70.335
IDEPT8313                                                   70.297
IDEPT5528                                                  70.1997
IDEPT1096                                                   70.177
IDEPT7783                                                  70.1423
Department_ID    [IDEPT2425, IDEPT8825, IDEPT7626, IDEPT8379, I...
Name: Marks, dtype: object